public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}


// 5.** Задать одномерный массив и найти в нем минимальный и максимальный элементы (без помощи интернета);
//   6.** Написать метод, в который передается не пустой одномерный целочисленный массив, метод должен вернуть true, если в массиве есть место,
//        в котором сумма левой и правой части массива равны. Примеры: checkBalance([2, 2, 2, 1, 2, 2, || 10, 1]) → true,
//        checkBalance([1, 1, 1, || 2, 1]) → true, граница показана символами ||, эти символы в массив не входят.
//   7.**** Написать метод, которому на вход подается одномерный массив и число n (может быть положительным, или отрицательным),
//   при этом метод должен сместить все элементы массива на n позиций. Для усложнения задачи нельзя пользоваться вспомогательными массивами.
