public class Main {


// всякая всячина

//    public static String createPhoneNumber(int[] numbers) {
//        for(int i=0;i<numbers.length;i++){
//
//
//
//        }
//    }

    public static void main(String[] args) {

    }
}
//




// 1) Стандартная задача с собеседований: при помощи метода drawSpiral(int height, int weight) и двумерного массива нарисовать спиральную матрицу:
//01 12 11 10
//02 13 16 09
//03 14 15 08
//04 05 06 07
//Принцип заполнения: вниз -> вправо -> вверх -> влево
//Учтите, что столбцов и строк может быть минимум 1. А если числа разных разрядов, то еще нужно подумать о форматировании (подсказка: printf() поможет)
